Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རྣམས་སྦྱོར་བ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་གཡེངས་པར་གྱུར་པའི་སེམས་ཅན་དག་མཐོང་ན། འདི་སྐད་དུ་སེམས་ཅན་ཁྱེད་ཅིའི་ཕྱིར་བསམ་གཏན་ལ་མཉམ་པར་མི་གཞོག་ཅེས་བརྗོད་དེ།
en: Subhūti, if you ask how bodhisattva great beings engage beings in the perfection of meditative concentration, while practicing the perfection of generosity, in this regard, Subhūti, if bodhisattva great beings see beings who are distracted, they would say, ‘Why are you beings not absorbed in meditative concentration?’

source: དེ་དག་རྐྱེན་དང་མི་ལྡན་པའི་ཕྱིར་རོ་ཞེས་ཟེར་ན། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་དེ་དག་ལ་འདི་སྐད་དུ་འདེམས་ཏེ། ཀྱེ་སེམས་ཅན་དག་ངས་རྐྱེན་གང་དང་གང་གིས་ཕྱི་ནང་གི་ཆོས་ལ་རྣམ་པར་རྟོག་པར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་རྐྱེན་ཉེ་བར་བསྒྲུབ་པར་བྱའོ་ཞེས་ནས།
en: And if they were to reply that it is because they lack fortunate conditions, in that case, bodhisattva great beings practicing the perfection of generosity should advise those beings, ‘O beings, I will provide you with favorable conditions according to your needs through which you will be without conceptual thoughts concerning external and internal phenomena.’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སེམས་ཅན་དེ་དག་ལ་རྐྱེན་གང་དང་གང་ཉེ་བར་བསྒྲུབས་པས་རྣམ་པར་རྟོག་པར་མི་འགྱུར་བ་དེ་ལྟ་བུའི་རྐྱེན་ཉེ་བར་བསྒྲུབ་སྟེ།
en: Consequently, these bodhisattva great beings will provide those beings with favorable conditions according to their needs, through which they will be without conceptual thoughts.

source: དེའི་ཕྱིར་དེ་དག་རྣམ་པར་རྟོག་པ་ཆད་ནས། བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་གོ །
en: So it is that those beings will sever their conceptual thoughts and become absorbed in the first meditative concentration.

source: བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They will become absorbed in the second meditative concentration, the third meditative concentration, and the fourth meditative concentration.

source: བྱམས་པ་ལ་སྙོམས་པར་འཇུག་གོ །
en: They will become absorbed in loving kindness.

source: སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་གོ །
en: They will become absorbed in compassion, empathetic joy, and equanimity.

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་གོ །
en: They will become absorbed in the sphere of infinite space, and they will become absorbed in the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception.

source: དེ་དག་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དེ་དག་གིས་སེམས་དུལ་བར་གྱུར་པས་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་སྒོམ་མོ། །ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: By having tamed their minds through absorption in these meditative concentrations, immeasurable attitudes, and formless absorptions, they will then cultivate the four applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྒོམ་མོ། །རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་སྒོམ་མོ།
en: They will cultivate the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path, and they will cultivate the three gateways to liberation. {

source: །དེ་དག་བསྒོམས་པས་རིམ་གྱིས་ཐེག་པ་གསུམ་པོས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་སྟེ། དེ་ལ་ལ་ལ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་བྱང་ཆུབ་ཀྱི་ལམ་ལས་ཡོངས་སུ་མི་ཉམ་སྟེ།
en: Ki.VIII: 117} By having cultivated these [attributes] they will gradually attain final nirvāṇa by means of the three vehicles, and some of them will not degenerate from the path of enlightenment until they have attained unsurpassed, complete enlightenment.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་པ་ཡིན་ནོ།
en: Subhūti, it is in this manner that bodhisattva great beings, while maintaining the perfection of generosity, attract beings through the perfection of meditative stability. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་འཆལ་པར་གྱུར་པའི་སེམས་ཅན་དག་མཐོང་ན། འདི་སྐད་དུ་སེམས་ཅན་ཁྱེད་ཅིའི་ཕྱིར་ཤེས་རབ་མི་སྒོམ་ཞེས་བརྗོད་དེ།
en: Subhūti, if you ask how bodhisattva great beings engage beings in the perfection of wisdom, while practicing the perfection of generosity, in this regard, Subhūti, if bodhisattva great beings maintaining the perfection of generosity see beings who have resorted to stupidity, they would say, ‘Why do you beings not cultivate wisdom?’

source: དེ་དག་རྐྱེན་དང་མི་ལྡན་པའི་ཕྱིར་རོ་ཞེས་ཟེར་ན། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་དེ་དག་ལ་འདི་སྐད་དུ་འདེམས་ཏེ། ང་ལས་ཡོ་བྱད་རྣམས་ལོང་ལ་སྦྱིན་པ་བྱིན་ཅིག་ཚུལ་ཁྲིམས་སྲུང་ཤིག །བཟོད་པ་སྒོམ་ཤིག་བརྩོན་འགྲུས་རྩོམས་ཤིག །ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་ཞོག་ཤིག །རྣམ་པ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམ་པ་ལ་བདག་གམ།
en: And if they were to reply that it is because they lack fortunate conditions, in that case, bodhisattva great beings practicing the perfection of generosity should advise and instruct those beings, saying, ‘Take resources from me!

source: སེམས་ཅན་ནམ།
en: Give gifts!

source: སྲོག་གམ། འགྲོ་བ་འམ་གསོ་བ་འམ་སྐྱེས་བུ་འམ། གང་ཟག་གམ་ཤེད་ཅན་ནམ་ཤེད་བདག་གམ། བྱེད་པ་པོ་འམ་ཚོར་བ་པོ་འམ་ཤེས་པ་པོ་འམ། མཐོང་བ་པོ་འམ་གཟུགས་སམ། ཚོར་བ་འམ།
en: Keep [the vows of] ethical discipline!

source: འདུ་ཤེས་སམ།
en: Cultivate tolerance!

source: འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པ་འམ། སྐྱེ་མཆེད་དམ། ཁམས་སམ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འམ། ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་སམ། སྟོང་པ་ཉིད་ཐམས་ཅད་དམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སམ། འཕགས་པའི་བདེན་པ་འམ།
en: Undertake acts of perseverance!

source: བསམ་གཏན་ནམ། ཚད་མེད་པ་འམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་འམ། རྣམ་པར་ཐར་པ་འམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་འམ། སྟོང་པ་ཉིད་དམ། མཚན་མ་མེད་པ་འམ། སྨོན་པ་མེད་པ་འམ། མངོན་པར་ཤེས་པ་འམ།
en: Be absorbed in meditative stability!

source: ཏིང་ངེ་འཛིན་ནམ། གཟུངས་ཀྱི་སྒོ་འམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་སམ། མི་འཇིགས་པ་འམ། སོ་སོ་ཡང་དག་པར་རིག་པ་འམ། སྙིང་རྗེ་ཆེན་པོ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སམ། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་བྱང་ཆུབ་བམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་རམ།
en: When you perfect these aspects and cultivate the perfection of wisdom, you should examine whether there is anything at all that exists, whether selves, sentient beings, life forms, living beings, lives, living creatures, individual persons, human beings, people, actors, experiencers, knowers, viewers, physical forms, feelings, perceptions, formative predispositions, consciousness, sense fields, sensory elements, links of dependent origination, perfections, any aspects of emptiness, factors conducive to enlightenment, truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, emptiness, signlessness, wishlessness, extrasensory powers, meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, great compassion, distinct qualities of the buddhas, the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, or [the goals], up to and including all-aspect omniscience.’ “

source: ཆོས་གང་ཡང་ཡོད་དམ། ཡོངས་སུ་རྟོགས་ཤིག་ཅེས་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ། དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་གང་ལ་དམིགས་པ་མངོན་པར་མཁྱེན་པར་འགྱུར་བ་དེ་ལྟ་བུ་ཆོས་གང་ཡང་མི་དམིགས་ཏེ།
en: Consequently, when these bodhisattva great beings practice the perfection of wisdom, they do not apprehend anything.

source: དེ་ལ་མངོན་པར་ཞེན་པ་མེད་པས་ཆོས་གང་ཡང་སྐྱེ་བ་འམ་འགག་པ་འམ། ཀུན་ནས་ཉོན་མོངས་པ་འམ། རྣམ་པར་བྱང་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: They do not apprehend any such thing on which they would be fixated, and since they are without fixation, they do not observe anything at all that arises or ceases, or that is defiled or purified.

source: ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བས། འདི་ནི་སེམས་ཅན་དམྱལ་བ་པའོ།
en: Since they do not observe anything, they do not think, ‘This is a being in the hells.

source: །འདི་ནི་བྱོལ་སོང་གི་སྐྱེ་གནས་པའོ།
en: This is one born in the animal realm.

source: །འདི་ནི་གཤིན་རྗེའི་འཇིག་རྟེན་པའོ།
en: This is one belonging to the world of Yama.

source: །འདི་ནི་ལྷ་མ་ཡིན་གྱི་རིགས་སུ་གཏོགས་པའོ།
en: This is one included within the class of asuras.

source: །འདི་ནི་ལྷའོ།
en: This is a god.

source: །འདི་ནི་མིའོ།
en: This is a human being.

source: །འདི་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པའོ།
en: This is one who keeps [the vows of] ethical discipline.

source: །འདི་ནི་ཚུལ་ཁྲིམས་ངན་པ་ཅན་ནོ།
en: This is an immoral being.

source: །འདི་ནི་རྒྱུན་ཏུ་ཞུགས་པའོ།
en: This is one has entered the stream to nirvāṇa.

source: །འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བའོ།
en: This is one destined for only one more rebirth.

source: །འདི་ནི་ཕྱིར་མི་འོང་བའོ།
en: This is one no longer subject to rebirth.

source: །འདི་ནི་དགྲ་བཅོམ་པའོ།
en: This is an arhat.

source: །འདི་ནི་རང་སངས་རྒྱས་སོ།
en: This is a pratyekabuddha.

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའོ།
en: This is a bodhisattva.

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་བྱ་བར་རྣམ་པར་མི་རྟོག་སྟེ།
en: This is a tathāgata, arhat, completely awakened buddha.’ “

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་པ་ཡིན་ནོ། །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Subhūti, it is in this manner that bodhisattva great beings, while maintaining the perfection of generosity, attract beings through the perfection of wisdom. {

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Ki.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་བར་ལ་སེམས་ཅན་རྣམས་སྦྱོར་བ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་དག་ལ་ཡོ་བྱད་རྣམས་ཉེ་བར་བསྒྲུབས་ཏེ།
en: VIII: 118} “Subhūti, if you ask how bodhisattva great beings engage beings in the thirty-seven factors conducive to enlightenment, while maintaining the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom, in this regard, Subhūti, bodhisattva great beings provide resources to beings, and the beings who are favored with these resources cultivate the factors conducive to enlightenment.

source: ཡོ་བྱད་དེ་དག་གིས་ཡོངས་སུ་ཟིན་པའི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སྒོམ་མོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དེ་བསྒོམ་པར་འཁོར་བ་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་ཏེ།
en: By cultivating these factors conducive to enlightenment, they will be released from cyclic existence.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཤིང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སེམས་ཅན་རྣམས་སྦྱོར་བ་ཡིན་ནོ།
en: Subhūti, it is in that manner that bodhisattva great beings, while maintaining the six perfections, engage beings in the thirty-seven factors conducive to enlightenment. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་སེམས་ཅན་མགོན་མེད་པ། སྡུག་བསྔལ་བ་ཁ་ཟས་དང་། གོས་ཀྱིས་འཕོངས་པ་དག་མཐོང་ན་འདི་ལྟར་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །རིགས་ཀྱི་བུ་དག་ཚུར་ཤེག་ང་ལས་ཟས་དང་སྐོམ་དང་གོས་དང་། བཞོན་པ་དང་།
en: Moreover, Subhūti, if bodhisattva great beings practicing the perfection of generosity see beings who are unprotected, imbued with suffering, and deprived of food and clothing, they bring them to maturation, advising and instructing them with the following words: ‘Come here, noble children! Take from me food, drink, transport, bedding, flowers, incense, perfume, garlands, unguents, the facilities of human beings, or any resources whatsoever, up to and including the seven precious materials!

source: མལ་ཆ་དང་།
en: Let them be of help to beings! [

source: མེ་ཏོག་དང་།
en: May that bring about your welfare, benefit, and happiness for a long period of time!

source: བདུག་སྤོས་དང་།
en: Do not think this benefit is theirs but not mine. You yourself have achieved this benefit for the sake of beings for a long time.

source: སྤོས་དང་།
en: You should think, “That which is mine is yours,” and dispense it for the sake of beings. Through that act of generosity, too, you should engage them in ethical discipline, and you should engage them in tolerance, perseverance, meditative concentration, and wisdom. You should engage them in all the aspects of emptiness and the thirty-seven factors conducive to enlightenment. You should engage them in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways. You should engage them in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: ཕྲེང་བ་དང་།
en: Do not be contented with that alone.

source: བྱུག་པ་དང་།
en: You should establish them higher still in uncontaminated attributes. That is to say, you should establish them in the fruit of entering the stream to nirvāṇa, and you should establish them in the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and unsurpassed, complete enlightenment.’ “Subhūti, bodhisattva great beings maintaining the perfection of generosity in that manner bring beings to maturation, they release those who have been brought to maturation in that manner from the three lower realms, and then release them from the entirety of cyclic existence. “Moreover, Subhūti, bodhisattva great beings maintaining the perfection of ethical discipline should bring beings to maturation in the following manner: {Ki.

source: མིའི་རྐྱེན་དང་།
en: VIII: 119} ‘You have engaged in immoral acts because you are lacking in favorable conditions.

source: ཡོ་བྱད་གང་ཅི་ཡང་རུང་སྟེ།
en: I will bestow these favorable conditions upon you.

source: རིན་པོ་ཆེ་བདུན་གྱི་བར་དུ་ལོང་ལ།
en: Take food, drink, clothing, transport, bedding, flowers, incense, perfume, garlands, unguents, the facilities of human beings, and any resource whatsoever, including the seven precious materials!

source: སེམས་ཅན་རྣམས་ལ་ཕན་ཐོགས་ཤིག །ཅེས་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏོ།
en: Let these be of benefit to beings!’] “

source: །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་ཤིང་སེམས་ཅན་དེ་དག་ལ་ཕན་པ་དེ་ལྟ་བུས་ཕན་འདོགས་ཏེ། ཕན་པ་དེ་ལྟ་བུས་ཕན་བཏགས་པས་དེ་དག་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་བླངས་ཤིང་གནས་ཏེ། དེ་དག་སྡོམ་པའི་ཚུལ་ཁྲིམས་མ་ཞིག་མ་གོད་པ། མ་འདྲེས་པ།
en: Maintaining the perfection of ethical discipline, they help beings through such acts of benefit, and when they have helped them through such acts of benefit, those beings come to adopt and maintain the ten virtuous actions.

source: སྐྱོན་མེད་པ། མ་ཉམས་པ། རང་དབང་ཡོད་པ། མཁས་པས་བསྔགས་པ། ཤིན་ཏུ་རྫོགས་པ་ཏིང་ངེ་འཛིན་གྱི་རྒྱུར་འགྱུར་བ་ལ་གནས་ཤིང་།
en: That is to say, they maintain the vows of ethical discipline, which are untainted, unadulterated, unblemished, nondegenerate, independent, praised by the wise, and absolutely perfect—the causal basis of meditative stability.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་གནས། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་གནས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་།
en: They maintain the six perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.

source: ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་གནས།
en: They maintain the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་གནས་ཤིང་།
en: They maintain the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་ཐོབ་པར་བྱེད་དོ།
en: And they are induced subsequently to attain all-aspect omniscience. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་སེམས་ཅན་ཤེས་རབ་འཆལ་བར་གྱུར་པ་བློ་ཆུང་བ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ།
en: Moreover, Subhūti, while maintaining the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, if bodhisattva great beings see beings who are narrow-minded and resorting to stupidity, they should bring them to maturation in the following manner: ‘You have resorted to stupidity because you are lacking in any favorable conditions.

source: རྐྱེན་གང་དང་མ་ལྡན་པས་ཁྱེད་ཤེས་རབ་འཆལ་བར་གྱུར་པའི་རྐྱེན་དེ་དག་ངས་ཁྱེད་ལ་བཤུགས་ཀྱིས་ཟས་དང་སྐོམ་དང་གོས་དང་། བཞོན་པ་དང་། མལ་ཆ་དང་། མེ་ཏོག་དང་། བདུག་སྤོས་དང་།
en: I will bestow these favorable conditions upon you.

source: སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། མིའི་རྐྱེན་དང་། ཡོ་བྱད་གང་ཅི་ཡང་རུང་བ་རིན་པོ་ཆེ་བདུན་གྱི་བར་དུ་ལོང་ཤིག་ཅེས་ནས།
en: Take food, drink, clothing, transport, bedding, flowers, incense, perfume, garlands, unguents, the facilities of human beings, and any resource whatsoever, including the seven precious materials!’ “

source: དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་དེ་དག་ལ་ཕན་པ་དེ་ལྟ་བུས་ཕན་འདོགས་ཏེ། ཕན་པ་དེ་ལྟ་བུས་ཕན་བཏགས་པས་རྨོངས་པ་མེད་ཅིང་ཤེས་རབ་དང་ལྡན་པར་གྱུར་པ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་།
en: Maintaining the perfection of wisdom [and so forth], they help beings through such acts of benefit, and having helped them through such acts of benefit, these beings who are undeluded and wise maintain the perfection of wisdom.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་གནས། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་གནས། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: They maintain the six perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.

source: རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་གནས།
en: They maintain the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཤིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། དེ་ལྟར་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་རྣམས་ངན་སོང་གསུམ་ལས་ཡོངས་སུ་ཐར་བ་ནས་འཁོར་བ་ཐམས་ཅད་ཀྱི་བར་ལས་ཡོངས་སུ་ཐར་རོ།
en: Subhūti, bodhisattva great beings who maintain the perfection of wisdom in that manner bring beings to maturation, they release those who have been brought to maturation in that manner from the three lower realms, and then release them from the entirety of cyclic existence.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་དྲུག་ཅུ་ལྔའོ།། །།
en: This completes the sixty-fifth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འདི་སྙམ་དུ་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟ་བུས་གོ་བགོ་བར་བྱ་ན། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་ཇི་ལྟ་བུ་ཞིག་ཡོད་སྙམ་པ་དང་།
en: Chapter 66 Then the venerable Subhūti thought, “When bodhisattva great beings thus don such armor, what is the path to enlightenment of bodhisattva great beings?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་སུ་ཆུད་ནས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་མོ།
en: Then the Blessed One, comprehending the thoughts in the mind of the venerable Subhūti, addressed him as follows: “Subhūti, the six perfections constitute the path of bodhisattva great beings.

source: །རབ་འབྱོར་སྟོང་པ་ཉིད་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་མོ།
en: Subhūti, all the aspects of emptiness constitute the path of bodhisattva great beings.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་མོ། །རབ་འབྱོར་འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: The thirty-seven factors conducive to enlightenment constitute the path of bodhisattva great beings.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་མོ།
en: Subhūti, the four truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and all the dhāraṇī gateways constitute the path of bodhisattva great beings.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་མོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great compassion, and the eighteen distinct qualities of the buddhas constitute the path of bodhisattva great beings.

source: །རབ་འབྱོར་གཞན་ཡང་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལམ་མོ།
en: Furthermore, Subhūti, all phenomena constitute the path of bodhisattva great beings. “

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསླབ་པར་མི་བྱ་བ་དང་། གང་ལ་མ་བསླབས་པས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་ལྟ་བུའི་ཆོས་གང་ཡང་ཡོད་དམ།
en: Subhūti, do you think that there is anything in which bodhisattva great beings should not train, and is there anything even without training in which they will attain consummate buddhahood in unsurpassed, complete enlightenment?

source: རབ་འབྱོར་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསླབ་པར་མི་བྱ་བའི་ཆོས་དེ་ལྟ་བུ་གང་ཡང་མེད་དེ།
en: Subhūti, there is nothing at all in which bodhisattva great beings should not train.

source: ཆོས་ཐམས་ཅད་ལ་མ་བསླབས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་ནུས་སོ།
en: Without having trained in all phenomena, bodhisattva great beings cannot attain all-aspect omniscience.”
